---
kind: property
id: P:Autodesk.Revit.DB.PlanViewRange.Current
source: html/4ced7a98-7576-a63b-f37e-97f70fd212c9.htm
---
# Autodesk.Revit.DB.PlanViewRange.Current Property

View range for the current plane

## Syntax (C#)
```csharp
public static ElementId Current { get; }
```